doc/dynamic-queries.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-23 Thu 18:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Dynamic Query Notes</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content">
<h1 class="title">Dynamic Query Notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd9c9ee7">Overview</a></li>
<li><a href="#org54884fc">Approach #1 Use sql-compile</a></li>
<li><a href="#org785a113">Approach #2 Use :raw</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd9c9ee7" class="outline-2">
<h2 id="orgd9c9ee7">Overview</h2>
<div class="outline-text-2" id="text-orgd9c9ee7">
<p>
The question often gets asked how to build dynamic or composable queries
in postmodern. First we need to remember that the query macro assumes that
everything that is not a list starting with a keyword will evaluate to a
string.
</p>

<p>
There are generally two approaches to building dynamic or composible queries,
either use sql-compile or use :raw. In either case you will need to ensure
that either you have control over the inputs or they still result in
parameterized queries. If not you have opened yourself up to an sql injection
attack.
</p>
</div>
</div>

<div id="outline-container-org54884fc" class="outline-2">
<h2 id="org54884fc">Approach #1 Use sql-compile</h2>
<div class="outline-text-2" id="text-org54884fc">
<p>
Sql-compile does a run-time compilation of an s-sql expression. In the
following example, we create a function that accepts a where-clause,
a table-name, 3 columns to select and two parameters to go into the where
clause.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(defun toy-example (where-clause table-name col1 col2 col3 arg1 arg2)
  (with-test-connection
   (query (sql-compile
           (append `(:select ,col1 ,col2 ,col3 :from ,table-name :where)
                   where-clause))
          arg1 arg2)))

(toy-example '((:and (:= 'city '$1) (:&gt; 'salary '$2))) 'employee 'id 'name 'city "Toronto" 45000)

((6 "James" "Toronto") (9 "Mary" "Toronto"))

</pre>
</div>
<p>
If we just look at what this call to sql-compile in toy-example generates, it would look like:
</p>
<div class="org-src-container">
<pre class="src src-lisp">"(SELECT id, name, city FROM employee WHERE ((city = $1) and (salary &gt; $2)))"
</pre>
</div>
<p>
This example is still a parameterized query but for security reasons you will
need to be very careful how you generate the where clause.
</p>

<p>
Another example with sql-compile and append, in this case updating a table and
setting two columns to NULL.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(sql-compile (append '(:update :table1 :set)
                     (loop for a in '("col1" "col2")
                           collect a
                           collect :NULL)))

"UPDATE table1 SET E'col1' = NULL, E'col2' = NULL"
</pre>
</div>

<p>
Lets think about it differently. What if we know the universe of columns we
want to select, but want to conditionally select some of them. Suppose we
know our targetted table has columns:
</p>

<p>
'id 'name 'salary 'start-date 'city 'region 'age.
</p>

<p>
We may decide we always want name, city and age, but salary and start-date are
conditional.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(defun toy-example-2 (salaryp start-date-p)
  (sql-compile
   (remove nil `(:select 'name 'city 'age
                         ,(if salaryp 'salary nil)
                         ,(if start-date-p 'start-date nil)
                         :from 'employee))))

(query (toy-example-2 t t))

(("Jason" "New York" 29 40420 #&lt;SIMPLE-DATE:DATE 01-02-1994&gt;)
 ("Robert" "Vancouver" 21 14420 #&lt;SIMPLE-DATE:DATE 02-01-1995&gt;)
 ("Celia" "Toronto" 24 24020 #&lt;SIMPLE-DATE:DATE 03-12-1996&gt;)
 ("Linda" "New York" 28 40620 #&lt;SIMPLE-DATE:DATE 04-11-1997&gt;)
 ("David" "Vancouver" 31 80026 #&lt;SIMPLE-DATE:DATE 05-10-1998&gt;)
 ("James" "Toronto" 26 70060 #&lt;SIMPLE-DATE:DATE 06-09-1999&gt;)
 ("Alison" "New York" 38 90620 #&lt;SIMPLE-DATE:DATE 07-08-2000&gt;)
 ("Chris" "Vancouver" 22 26020 #&lt;SIMPLE-DATE:DATE 08-07-2001&gt;)
 ("Mary" "Toronto" 34 60020 #&lt;SIMPLE-DATE:DATE 08-06-2002&gt;))

(query (toy-example-2 t nil))

(("Jason" "New York" 29 40420) ("Robert" "Vancouver" 21 14420)
 ("Celia" "Toronto" 24 24020) ("Linda" "New York" 28 40620)
 ("David" "Vancouver" 31 80026) ("James" "Toronto" 26 70060)
 ("Alison" "New York" 38 90620) ("Chris" "Vancouver" 22 26020)
 ("Mary" "Toronto" 34 60020))

</pre>
</div>
<p>
You could skip the (remove nil&#x2026; portion and substitute t for nil. E.g.
</p>
<div class="org-src-container">
<pre class="src src-lisp">(defun toy-example-2 (salaryp start-date-p)
  (sql-compile
   `(:select 'name 'city 'age
             ,(if salaryp 'salary t)
             ,(if start-date-p 'start-date t)
             :from 'employee)))
</pre>
</div>
<p>
But I prefer to remove those segments completely from the query.
</p>

<p>
Following on this same thread of thought, you can define a portion of the
sql in a let clause:
</p>
<div class="org-src-container">
<pre class="src src-lisp">(let ((sql1 '(:= name "Jason")))
  (query (sql-compile
    `(:select 'name 'city 'age :from 'employee :where ,sql1))))

(("Jason" "New York" 29))
</pre>
</div>
</div>
</div>

<div id="outline-container-org785a113" class="outline-2">
<h2 id="org785a113">Approach #2 Use :raw</h2>
<div class="outline-text-2" id="text-org785a113">
<p>
To quote Marijn, the :raw keyword takes a string and inserts it straight
into the query. I try to stay away from :raw if possible, but sometimes&#x2026;
</p>

<div class="org-src-container">
<pre class="src src-lisp">(query (:select (:raw "tmp1.name") :from (:as 'baz (:raw "tmp1"))))
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-08-23 Thu 18:13</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
